ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/source/cyhal_i2s.c
    /*
     * We will update this to owned later if appropriate - for now set to false
     * so we don't try to free if we fail before allocating a clock
     */
    obj->is_clock_owned = false;

    obj->user_enabled_events = 0u;

    obj->callback_data.callback = NULL;
    obj->callback_data.callback_arg = NULL;
    obj->async_mode = CYHAL_ASYNC_SW;
    obj->async_tx_buff = NULL;
    obj->async_rx_buff = NULL;
    obj->tx_dma.resource.type = CYHAL_RSC_INVALID;
    obj->rx_dma.resource.type = CYHAL_RSC_INVALID;

    cy_rslt_t result = CY_RSLT_SUCCESS;

    /* Determine which I2S instance to use */
    const cyhal_resource_pin_mapping_t *tx_sck_map = (NULL != tx_pins) ? CY_UTILS_GET_RESOURCE(tx_pins->sck, cyhal_pin_map_audioss_tx_sck) : NULL;
    const cyhal_resource_pin_mapping_t *tx_ws_map  = (NULL != tx_pins) ? CY_UTILS_GET_RESOURCE(tx_pins->ws, cyhal_pin_map_audioss_tx_ws) : NULL;
    const cyhal_resource_pin_mapping_t *tx_sdo_map = (NULL != tx_pins) ? CY_UTILS_GET_RESOURCE(tx_pins->data, cyhal_pin_map_audioss_tx_sdo) : NULL;

    const cyhal_resource_pin_mapping_t *rx_sck_map = (NULL != rx_pins) ? CY_UTILS_GET_RESOURCE(rx_pins->sck, cyhal_pin_map_audioss_rx_sck) : NULL;
    const cyhal_resource_pin_mapping_t *rx_ws_map  = (NULL != rx_pins) ? CY_UTILS_GET_RESOURCE(rx_pins->ws, cyhal_pin_map_audioss_rx_ws) : NULL;
    const cyhal_resource_pin_mapping_t *rx_sdi_map = (NULL != rx_pins) ? CY_UTILS_GET_RESOURCE(rx_pins->data, cyhal_pin_map_audioss_rx_sdi) : NULL;

    const cyhal_resource_pin_mapping_t *mclk_map = CY_UTILS_GET_RESOURCE(mclk, cyhal_pin_map_audioss_clk_i2s_if);

    if(NULL != tx_pins) /* It is valid to leave either tx or rx empty */
    {
        if(NULL != tx_sck_map && NULL != tx_ws_map && NULL != tx_sdo_map
            && cyhal_utils_resources_equal_all(3, tx_sck_map->inst, tx_ws_map->inst, tx_sdo_map->inst))
        {
            obj->resource = *(tx_sck_map->inst);
        }
        else
        {
            result = CYHAL_I2S_RSLT_ERR_INVALID_PIN;
        }
    }

    if(CY_RSLT_SUCCESS == result && NULL != rx_pins)
    {
        if(NULL == rx_sck_map || NULL == rx_ws_map || NULL == rx_sdi_map ||
            (false == cyhal_utils_resources_equal_all(3, rx_sck_map->inst, rx_ws_map->inst, rx_sdi_map->inst)))
        {
            result = CYHAL_I2S_RSLT_ERR_INVALID_PIN;
        }
        else
        {
            if((obj->resource.type != CYHAL_RSC_INVALID)
                && (false == cyhal_utils_resources_equal(&(obj->resource), rx_sck_map->inst)))
            {
                /* TX pins and RX pins don't map to the same instance */
                result = CYHAL_I2S_RSLT_ERR_INVALID_PIN;
            }
            obj->resource = *(rx_sck_map->inst);
        }
    }

    if(CYHAL_RSC_INVALID == obj->resource.type) /* If this happens it means neither rx nor tx was specified */
    {
        result = CYHAL_I2S_RSLT_ERR_INVALID_PIN;
    }

    if(CY_RSLT_SUCCESS == result && CYHAL_NC_PIN_VALUE != mclk )
    {
        if(NULL == mclk_map || (false == cyhal_utils_resources_equal(&(obj->resource), mclk_map->inst)))
        {
            result = CYHAL_I2S_RSLT_ERR_INVALID_PIN;
        }
    }

    if(CY_RSLT_SUCCESS == result)
    {
        result = cyhal_hwmgr_reserve(&(obj->resource));
        obj->base = cyhal_i2s_base[obj->resource.block_num];
    }

    /* Reserve the pins */
    if(CY_RSLT_SUCCESS == result && NULL != tx_pins)
    {
        result = cyhal_utils_reserve_and_connect(tx_pins->sck, tx_sck_map);
        if(CY_RSLT_SUCCESS == result)
        {
            obj->pin_tx_sck = tx_pins->sck;
            result = cyhal_utils_reserve_and_connect(tx_pins->ws, tx_ws_map);
        }
        if(CY_RSLT_SUCCESS == result)
        {
            obj->pin_tx_ws = tx_pins->ws;
            result = cyhal_utils_reserve_and_connect(tx_pins->data, tx_sdo_map);
        }
        if(CY_RSLT_SUCCESS == result)
        {
            obj->pin_tx_sdo = tx_pins->data;
        }

        // In slave mode, the clock and word select pins are inputs
        if(CY_RSLT_SUCCESS == result && obj->is_tx_slave)
        {
            result = cyhal_gpio_configure(obj->pin_tx_sck, CYHAL_GPIO_DIR_INPUT, CYHAL_GPIO_DRIVE_NONE);
            if(CY_RSLT_SUCCESS == result)
            {
                result = cyhal_gpio_configure(obj->pin_tx_ws, CYHAL_GPIO_DIR_INPUT, CYHAL_GPIO_DRIVE_NONE);
            }
        }
    }

    if(CY_RSLT_SUCCESS == result && NULL != rx_pins)
    {
        result = cyhal_utils_reserve_and_connect(rx_pins->sck, rx_sck_map);
        if(CY_RSLT_SUCCESS == result)
        {
            obj->pin_rx_sck = rx_pins->sck;
            result = cyhal_utils_reserve_and_connect(rx_pins->ws, rx_ws_map);
        }
        if(CY_RSLT_SUCCESS == result)
        {
            obj->pin_rx_ws = rx_pins->ws;
            result = cyhal_utils_reserve_and_connect(rx_pins->data, rx_sdi_map);
        }
        if(CY_RSLT_SUCCESS == result)
        {
            obj->pin_rx_sdi = rx_pins->data;
        }

        // In slave mode, the clock and word select pins are inputs
        if(CY_RSLT_SUCCESS == result && obj->is_rx_slave)
        {
            result = cyhal_gpio_configure(obj->pin_rx_sck, CYHAL_GPIO_DIR_INPUT, CYHAL_GPIO_DRIVE_NONE);
            if(CY_RSLT_SUCCESS == result)
            {
                result = cyhal_gpio_configure(obj->pin_rx_ws, CYHAL_GPIO_DIR_INPUT, CYHAL_GPIO_DRIVE_NONE);
            }
        }
    }

    if(CY_RSLT_SUCCESS == result && CYHAL_NC_PIN_VALUE != mclk)
    {
        if(obj->mclk_hz == 0)
        {
            // Must specify mclk frequency when using mclk
            result = CYHAL_I2S_RSLT_ERR_INVALID_ARG;
        }
        else
        {
            result = cyhal_utils_reserve_and_connect(mclk, mclk_map);
            if(CY_RSLT_SUCCESS == result)
            {
                obj->pin_mclk = mclk;
            }
        }
    }

    if(CY_RSLT_SUCCESS == result && CYHAL_NC_PIN_VALUE == mclk)
    {
        // Must not specify mclk frequency when mclk pin is not in use
        if(obj->mclk_hz != 0)
        {
            result = CYHAL_I2S_RSLT_ERR_INVALID_ARG;
        }
    }

