ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/source/cyhal_i2s.c
    if(CY_RSLT_SUCCESS == result && obj->word_length > obj->channel_length)
    {
        // Word length must be less than or equal to channel length
        result = CYHAL_I2S_RSLT_ERR_INVALID_ARG;
    }

    if (CY_RSLT_SUCCESS == result)
    {
        if (clk == NULL && CYHAL_NC_PIN_VALUE == mclk) // No need to reserve a clock if we're using the mclk pin
        {
            // The hardware is generally going to be hardwired to an hfclk, which has very limited divider options. In the event
            // that we're hooked up a PERI divider, we don't have any particular expectations about its width - so just ask for 8-bit
            result = cyhal_utils_allocate_clock(&(obj->clock), &(obj->resource), CY_SYSCLK_DIV_8_BIT, true);
            if(CY_RSLT_SUCCESS == result)
            {
                obj->is_clock_owned = true;
                result = cyhal_clock_set_enabled(&(obj->clock), true, true);
            }
        }
        else
        {
            obj->clock = *clk;
        }
    }

    uint8_t sclk_div;
    if(CY_RSLT_SUCCESS == result)
    {
        result = cyhal_i2s_compute_sclk_div(obj, obj->sample_rate_hz, &sclk_div);
    }

    cy_stc_i2s_config_t pdl_config;
    if (CY_RSLT_SUCCESS == result)
    {
        result = cyhal_i2s_populate_pdl_config(obj, &pdl_config, sclk_div);
    }

    if (CY_RSLT_SUCCESS == result)
    {
        result = (cy_rslt_t)Cy_I2S_Init(obj->base, &pdl_config);
    }

    if (CY_RSLT_SUCCESS == result)
    {
        if(pdl_config.txEnabled)
        {
            Cy_I2S_ClearTxFifo(obj->base);
        }
        if(pdl_config.rxEnabled)
        {
            Cy_I2S_ClearRxFifo(obj->base);
        }

        obj->pm_callback.states = (cyhal_syspm_callback_state_t)(CYHAL_SYSPM_CB_CPU_DEEPSLEEP | CYHAL_SYSPM_CB_SYSTEM_HIBERNATE);
        obj->pm_callback.callback = &cyhal_i2s_pm_callback;
        obj->pm_callback.next = NULL;
        obj->pm_callback.args = (void*)obj;
        obj->pm_callback.ignore_modes = CYHAL_SYSPM_BEFORE_TRANSITION;
        obj->pm_transition_ready = false;
        cyhal_syspm_register_peripheral_callback(&(obj->pm_callback));

        cyhal_i2s_config_structs[obj->resource.block_num] = obj;
        cy_stc_sysint_t irqCfg = { cyhal_i2s_irq_n[obj->resource.block_num], CYHAL_ISR_PRIORITY_DEFAULT };
        Cy_SysInt_Init(&irqCfg, cyhal_i2s_irq_handler);
        NVIC_EnableIRQ(cyhal_i2s_irq_n[obj->resource.block_num]);
    }

    if (CY_RSLT_SUCCESS != result)
    {
        cyhal_i2s_free(obj);
    }
    return result;
}

void cyhal_i2s_free(cyhal_i2s_t *obj)
{
    CY_ASSERT(NULL != obj);

    if(CYHAL_RSC_INVALID != obj->resource.type)
    {
        IRQn_Type irqn = cyhal_i2s_irq_n[obj->resource.block_num];
        NVIC_DisableIRQ(irqn);

        cyhal_syspm_unregister_peripheral_callback(&(obj->pm_callback));
        cyhal_hwmgr_free(&(obj->resource));
        obj->base = NULL;
        obj->resource.type = CYHAL_RSC_INVALID;
    }

    cyhal_utils_release_if_used(&(obj->pin_tx_sck));
    cyhal_utils_release_if_used(&(obj->pin_tx_ws));
    cyhal_utils_release_if_used(&(obj->pin_tx_sdo));
    cyhal_utils_release_if_used(&(obj->pin_rx_sck));
    cyhal_utils_release_if_used(&(obj->pin_rx_ws));
    cyhal_utils_release_if_used(&(obj->pin_rx_sdi));
    cyhal_utils_release_if_used(&(obj->pin_mclk));

    if(obj->is_clock_owned)
    {
        cyhal_hwmgr_free_clock(&(obj->clock));
    }

    if(CYHAL_RSC_INVALID != obj->rx_dma.resource.type)
    {
        cyhal_dma_free(&obj->rx_dma);
    }

    if(CYHAL_RSC_INVALID != obj->tx_dma.resource.type)
    {
        cyhal_dma_free(&obj->tx_dma);
    }
}

static cy_rslt_t cyhal_i2s_compute_sclk_div(cyhal_i2s_t *obj, uint32_t sample_rate_hz, uint8_t *sclk_div)
{
    const uint8_t MAX_SCLK_DIVIDER = 64; // Divider value internal to the I2S block
    const cyhal_clock_tolerance_t SCLK_TOLERANCE = { .type = CYHAL_TOLERANCE_PERCENT, .value = 1 };
    uint32_t sclk_target = sample_rate_hz * obj->channel_length * 2 /* left + right channel */;
    *sclk_div = 0;

    if(obj->is_clock_owned)
    {
        // Try each of the divider values that we support internally, and see whether any of them gets us
        // within our tolerance of a frequency that our source clock can provide.
        for(uint8_t i = 1; i <= MAX_SCLK_DIVIDER; ++i)
        {
            uint32_t desired_source_freq = sclk_target * i * 8; // I2S hw has a hard-wired 8x divider
            cy_rslt_t freq_result = cyhal_utils_set_clock_frequency(&(obj->clock), desired_source_freq, &SCLK_TOLERANCE);
            if(CY_RSLT_SUCCESS == freq_result)
            {
                *sclk_div = i;
                break;
            }
        }
    }
    else // Using user-provided clock, or using the mclk pin
    {
        // We can't change the clock, so just check if it's within tolerance
        uint32_t desired_divided_freq = sclk_target * 8; // I2S hw has a hard-wired 8x divider
        uint32_t actual_source_freq = (CYHAL_NC_PIN_VALUE == obj->pin_mclk) ? cyhal_clock_get_frequency(&obj->clock) : obj->mclk_hz;
        uint32_t best_divider = (actual_source_freq + (desired_divided_freq / 2)) / desired_divided_freq; // Round to nearest divider
        uint32_t desired_source_freq = desired_divided_freq * best_divider;
        uint32_t diff = abs(cyhal_utils_calculate_tolerance(SCLK_TOLERANCE.type, desired_source_freq, actual_source_freq));
        if(diff <= SCLK_TOLERANCE.value && best_divider <= MAX_SCLK_DIVIDER)
        {
            *sclk_div = best_divider;
        }
    }

    return (0 == *sclk_div) ? CYHAL_I2S_RSLT_ERR_CLOCK : CY_RSLT_SUCCESS;
}

cy_rslt_t cyhal_i2s_set_sample_rate(cyhal_i2s_t *obj, uint32_t sample_rate_hz)
{
    uint8_t sclk_div;
    cy_stc_i2s_config_t pdl_config;

    cy_rslt_t result = cyhal_i2s_compute_sclk_div(obj, sample_rate_hz, &sclk_div);
    if(CY_RSLT_SUCCESS == result)
    {
        result = cyhal_i2s_populate_pdl_config(obj, &pdl_config, sclk_div);
    }
    if(CY_RSLT_SUCCESS == result)
    {
        Cy_I2S_DeInit(obj->base);
        result = (cy_rslt_t)Cy_I2S_Init(obj->base, &pdl_config);
    }
    if(CY_RSLT_SUCCESS == result)
    {
        obj->sample_rate_hz = sample_rate_hz;
    }

    return result;
}

