ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/source/cyhal_i2s.c
static void cyhal_i2s_process_event(cyhal_i2s_t *obj, cyhal_i2s_event_t event)
{
    if(0 != (event & (CYHAL_I2S_TX_HALF_EMPTY | CYHAL_I2S_TX_EMPTY)))
    {
        /* We should normally not get the "empty" interrupt during an async transfer because we
         * should be topping the FIFO back up after each half-empty interrupt. But in case something
         * delays our response and the FIFO gets all the way to empty, listen for that as well
         */
        if(NULL != obj->async_tx_buff && obj->async_tx_length > 0)
        {
            switch(obj->async_mode)
            {
                case CYHAL_ASYNC_SW:
                {
                    /* Write as much as we can out until the FIFO is full
                     * This is a potentially long operation but we don't want other I2S operations to
                     * interleave with it. So do a "mini critical section" and disable the interrupts for this block only.
                     */
                    uint32_t old_interrupt_mask = Cy_I2S_GetInterruptMask(obj->base);
                    Cy_I2S_SetInterruptMask(obj->base, 0u);
                    cyhal_i2s_write_until_full(obj, &obj->async_tx_buff, &obj->async_tx_length);
                    Cy_I2S_SetInterruptMask(obj->base, old_interrupt_mask);
                    if(0 == obj->async_tx_length)
                    {
                        /* We finished the async transfer.  */
                        event |= CYHAL_I2S_ASYNC_TX_COMPLETE;
                    }
                    break;
                }
                case CYHAL_ASYNC_DMA:
                    cyhal_i2s_dma_perform_tx(obj);
                    break;
                default:
                    CY_ASSERT(0); /* Unrecognized async mode */
                    break;
            }
        }
    }
    if(0 != (event & (CYHAL_I2S_RX_HALF_FULL | CYHAL_I2S_RX_FULL))
        || (obj->async_rx_length < (CYHAL_I2S_FIFO_DEPTH / 2) && (0u != (event & CYHAL_I2S_RX_NOT_EMPTY))))
    {
        /* Similar to TX, we don't expect to receive the "full" interrupt, but check for it out of caution */
        if(NULL != obj->async_rx_buff && obj->async_rx_length > 0)
        {
            switch(obj->async_mode)
            {
                case CYHAL_ASYNC_SW:
                {
                   /* Read as much as we can until the FIFO is empty
                    * This is a potentially long operation but we don't want other I2S operations to
                    * interleave with it. So do a "mini critical section" and disable the interrupts for this block only.
                    */
                   uint32_t old_interrupt_mask = Cy_I2S_GetInterruptMask(obj->base);
                   Cy_I2S_SetInterruptMask(obj->base, 0u);
                   cyhal_i2s_read_until_empty(obj, &obj->async_rx_buff, &obj->async_rx_length);
                   Cy_I2S_SetInterruptMask(obj->base, old_interrupt_mask);
                   if(obj->async_rx_length < (CYHAL_I2S_FIFO_DEPTH / 2))
                   {
                       /* At this point the half full interrupt won't fire until after we've received
                        * the remaining data, so switch to reading out each word as it comes in.
                        * Call update enabled when we're at 0 too so that the RX not empty event gets turned off again
                        */
                        cyhal_i2s_update_enabled_events(obj);
                        if(0 == obj->async_rx_length)
                        {
                            /* We finished the async transfer.  */
                            event |= CYHAL_I2S_ASYNC_RX_COMPLETE;
                        }
                   }
                   break;
                }
                case CYHAL_ASYNC_DMA:
                   cyhal_i2s_dma_perform_rx(obj);
                   break;

                default:
                   CY_ASSERT(0); /* Unrecognized async mode */
            }
        }
    }

    /* Mark async transfer as complete if we just finished one. */
    if(0 != (event & CYHAL_I2S_ASYNC_TX_COMPLETE))
    {
        obj->async_tx_buff = NULL;
        cyhal_i2s_update_enabled_events(obj);
    }
    if(0 != (event & CYHAL_I2S_ASYNC_RX_COMPLETE))
    {
        obj->async_rx_buff = NULL;
        cyhal_i2s_update_enabled_events(obj);
    }

    if(0 != (event & ((cyhal_i2s_event_t)obj->user_enabled_events)))
    {
        cyhal_i2s_event_callback_t callback = (cyhal_i2s_event_callback_t)obj->callback_data.callback;
        if(NULL != callback)
        {
            callback(obj->callback_data.callback_arg, (cyhal_i2s_event_t)(event & obj->user_enabled_events));
        }
    }
}

static bool cyhal_i2s_pm_callback(cyhal_syspm_callback_state_t state, cyhal_syspm_callback_mode_t mode, void* callback_arg)
{
    cyhal_i2s_t *obj = (cyhal_i2s_t *)callback_arg;
    CY_UNUSED_PARAMETER(state);

    switch(mode)
    {
        case CYHAL_SYSPM_CHECK_READY:
            obj->pm_transition_ready = Cy_I2S_GetCurrentState(obj->base) == 0 && !(cyhal_i2s_is_read_pending(obj) || cyhal_i2s_is_tx_busy(obj));
            return obj->pm_transition_ready;
        case CYHAL_SYSPM_CHECK_FAIL:
        case CYHAL_SYSPM_AFTER_TRANSITION:
            obj->pm_transition_ready = false;
            return true;
        default:
            return true;
    }
}

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXSCB */
